Autodesk.Revit.DB.Architecture.ContinuousRailType.HandClearance
The horizontal distance between the inner boundary of the rail and the path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for clearance must be no more than 30000 feet in absolute value.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.Projection
The horizontal distance between the outer boundary of the rail and the path.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopTermination
The termination of the rail at the end or top.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The termination is not a valid termination symbol for continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomTermination
The termination of the rail at the beginning or bottom.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The termination is not a valid termination symbol for continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.FilletRadius
The fillet radius of the rail join.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for filletRadius must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The join option of the rail is not fillet so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.DefaultJoinOption
The default join option between two rails.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.Transition
The transition option of the rail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopExtensionStyle
The extension style of the rail termination at the end or top.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomExtensionStyle
The extension style of the rail termination at the beginning or bottom.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.ProfileId
The id of the profile of the rail
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profileId is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profileId is not a valid profile symbol for continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopExtensionLength
The extension length of the rail termination at the end or top.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for endExtensionLength must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomExtensionLength
The extension length of the rail termination at the beginning or bottom.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for startExtensionLength must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType
A type element containing the properties of a continuous rail.
Since:
2013